src/_k6/results/202607131327/net10-minapi-ef-jit_100rec_60svus_200_summary.txt
     ✓ net10-minapi-ef-jit status is 200
     ✓ net10-minapi-ef-jit response is JSON
     ✓ net10-minapi-ef-jit response has all data records
     ✓ net10-minapi-ef-jit response first item has expected fields

     checks.........................: 100.00% ✓ 47236      ✗ 0    
     data_received..................: 846 MB  12 MB/s
     data_sent......................: 6.3 MB  89 kB/s
     http_req_blocked...............: avg=7.4ms    min=1.41µs  med=3.12µs   max=1.81s p(90)=5.21µs   p(95)=7.34µs   p(99)=341.63ms
     http_req_connecting............: avg=7.12ms   min=0s      med=0s       max=1.81s p(90)=0s       p(95)=0s       p(99)=341.15ms
   ✗ http_req_duration..............: avg=871.72ms min=2.94ms  med=827.35ms max=5.18s p(90)=1.56s    p(95)=1.97s    p(99)=2.72s   
       { expected_response:true }...: avg=871.72ms min=2.94ms  med=827.35ms max=5.18s p(90)=1.56s    p(95)=1.97s    p(99)=2.72s   
   ✓ http_req_failed................: 0.00%   ✓ 0          ✗ 11809
     http_req_receiving.............: avg=207.21ms min=51.94µs med=94.88µs  max=3.56s p(90)=816.82ms p(95)=1.19s    p(99)=1.92s   
     http_req_sending...............: avg=41.89ms  min=5.35µs  med=11µs     max=2.66s p(90)=65.46ms  p(95)=309.67ms p(99)=784.2ms 
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s    p(90)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=622.62ms min=2.51ms  med=625.6ms  max=2.4s  p(90)=1.08s    p(95)=1.18s    p(99)=1.56s   
     http_reqs......................: 11809   166.304676/s
     iteration_duration.............: avg=1.1s     min=11.15ms med=961.89ms max=6.28s p(90)=2.13s    p(95)=2.63s    p(99)=3.65s   
     iterations.....................: 11809   166.304676/s
     vus............................: 17      min=17       max=200
     vus_max........................: 200     min=200      max=200