src/_k6/results/202607131327/net10-minapi-ef-jit_manyparams_60svus_50_summary.txt
     ✓ net10-minapi-ef-jit status is 200
     ✓ net10-minapi-ef-jit response is JSON
     ✓ net10-minapi-ef-jit response has param_count
     ✓ net10-minapi-ef-jit response has checksum

     checks.........................: 100.00% ✓ 3139324     ✗ 0     
     data_received..................: 177 MB  2.5 MB/s
     data_sent......................: 290 MB  4.1 MB/s
     http_req_blocked...............: avg=1.74µs  min=600ns    med=1.36µs  max=6.81ms   p(90)=1.85µs  p(95)=2.13µs  p(99)=4.66µs  
     http_req_connecting............: avg=48ns    min=0s       med=0s      max=6.68ms   p(90)=0s      p(95)=0s      p(99)=0s      
   ✓ http_req_duration..............: avg=4.06ms  min=398.59µs med=3.33ms  max=242.63ms p(90)=6.92ms  p(95)=9.08ms  p(99)=15.26ms 
       { expected_response:true }...: avg=4.06ms  min=398.59µs med=3.33ms  max=242.63ms p(90)=6.92ms  p(95)=9.08ms  p(99)=15.26ms 
   ✓ http_req_failed................: 0.00%   ✓ 0           ✗ 784831
     http_req_receiving.............: avg=25.83µs min=6.48µs   med=12.52µs max=28.33ms  p(90)=21.19µs p(95)=30.33µs p(99)=194.81µs
     http_req_sending...............: avg=13.03µs min=2.02µs   med=4.59µs  max=29.77ms  p(90)=6.39µs  p(95)=9.09µs  p(99)=107.49µs
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s      p(99)=0s      
     http_req_waiting...............: avg=4.02ms  min=374.11µs med=3.31ms  max=242.6ms  p(90)=6.85ms  p(95)=8.98ms  p(99)=15.09ms 
     http_reqs......................: 784831  11209.71034/s
     iteration_duration.............: avg=4.13ms  min=471.59µs med=3.4ms   max=242.7ms  p(90)=7.01ms  p(95)=9.18ms  p(99)=15.39ms 
     iterations.....................: 784831  11209.71034/s
     vus............................: 50      min=5         max=50  
     vus_max........................: 50      min=50        max=50