src/_k6/results/202607131327/npgsqlrest-file-aot-v3.21.0_100rec_60svus_1_summary.txt
     ✓ npgsqlrest-file-aot-v3.21.0 status is 200
     ✓ npgsqlrest-file-aot-v3.21.0 response is JSON
     ✓ npgsqlrest-file-aot-v3.21.0 response has all data records
     ✓ npgsqlrest-file-aot-v3.21.0 response first item has expected fields

     checks.........................: 100.00% ✓ 26272     ✗ 0   
     data_received..................: 466 MB  6.7 MB/s
     data_sent......................: 3.6 MB  51 kB/s
     http_req_blocked...............: avg=3.39µs  min=1.72µs   med=2.55µs  max=521.31µs p(90)=3.9µs    p(95)=6.07µs   p(99)=10.84µs 
     http_req_connecting............: avg=15ns    min=0s       med=0s      max=102.62µs p(90)=0s       p(95)=0s       p(99)=0s      
   ✓ http_req_duration..............: avg=3.79ms  min=1.56ms   med=4.03ms  max=23.33ms  p(90)=4.62ms   p(95)=5.46ms   p(99)=7.22ms  
       { expected_response:true }...: avg=3.79ms  min=1.56ms   med=4.03ms  max=23.33ms  p(90)=4.62ms   p(95)=5.46ms   p(99)=7.22ms  
   ✓ http_req_failed................: 0.00%   ✓ 0         ✗ 6568
     http_req_receiving.............: avg=1.45ms  min=59.19µs  med=1.51ms  max=18.76ms  p(90)=1.82ms   p(95)=2.29ms   p(99)=3.24ms  
     http_req_sending...............: avg=51.68µs min=5.98µs   med=8.75µs  max=1.7ms    p(90)=188.66µs p(95)=261.22µs p(99)=372.96µs
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=2.28ms  min=963.78µs med=2.42ms  max=12.08ms  p(90)=2.77ms   p(95)=3.35ms   p(99)=5.09ms  
     http_reqs......................: 6568    93.821924/s
     iteration_duration.............: avg=10.64ms min=6.32ms   med=10.51ms max=35.49ms  p(90)=12.17ms  p(95)=13.74ms  p(99)=18.33ms 
     iterations.....................: 6568    93.821924/s
     vus............................: 1       min=1       max=1 
     vus_max........................: 1       min=1       max=1