src/_k6/results/202607131327/npgsqlrest-file-jit-v3.21.0_manyparams_60svus_200_summary.txt
     ✓ npgsqlrest-file-jit-v3.21.0 status is 200
     ✓ npgsqlrest-file-jit-v3.21.0 response is JSON
     ✓ npgsqlrest-file-jit-v3.21.0 response has param_count
     ✓ npgsqlrest-file-jit-v3.21.0 response has checksum

     checks.........................: 100.00% ✓ 3529408      ✗ 0     
     data_received..................: 190 MB  2.7 MB/s
     data_sent......................: 334 MB  4.8 MB/s
     http_req_blocked...............: avg=3.64µs   min=690ns    med=1.44µs  max=41.95ms  p(90)=2.07µs  p(95)=2.34µs  p(99)=4.88µs 
     http_req_connecting............: avg=1.75µs   min=0s       med=0s      max=41.92ms  p(90)=0s      p(95)=0s      p(99)=0s     
   ✓ http_req_duration..............: avg=13ms     min=180.39µs med=11.52ms max=418.63ms p(90)=23.13ms p(95)=29.77ms p(99)=44.23ms
       { expected_response:true }...: avg=13ms     min=180.39µs med=11.52ms max=418.63ms p(90)=23.13ms p(95)=29.77ms p(99)=44.23ms
   ✓ http_req_failed................: 0.00%   ✓ 0            ✗ 882352
     http_req_receiving.............: avg=111.16µs min=6.75µs   med=14.08µs max=67.42ms  p(90)=21.56µs p(95)=66.14µs p(99)=2.26ms 
     http_req_sending...............: avg=37.1µs   min=2.12µs   med=5.14µs  max=57.89ms  p(90)=7.09µs  p(95)=14.47µs p(99)=125.3µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s      p(99)=0s     
     http_req_waiting...............: avg=12.85ms  min=162.59µs med=11.4ms  max=414.38ms p(90)=22.94ms p(95)=29.28ms p(99)=43.43ms
     http_reqs......................: 882352  12602.611296/s
     iteration_duration.............: avg=14.72ms  min=223.94µs med=12.48ms max=423.96ms p(90)=27.69ms p(95)=35.43ms p(99)=53.26ms
     iterations.....................: 882352  12602.611296/s
     vus............................: 200     min=19         max=200 
     vus_max........................: 200     min=200        max=200