src/_k6/results/202607131327/npgsqlrest-routine-aot-v3.4.7_500rec_60svus_1_summary.txt
     ✓ npgsqlrest-routine-aot-v3.4.7 status is 200
     ✓ npgsqlrest-routine-aot-v3.4.7 response is JSON
     ✓ npgsqlrest-routine-aot-v3.4.7 response has all data records
     ✓ npgsqlrest-routine-aot-v3.4.7 response first item has expected fields

     checks.........................: 100.00% ✓ 6056      ✗ 0   
     data_received..................: 542 MB  7.7 MB/s
     data_sent......................: 825 kB  12 kB/s
     http_req_blocked...............: avg=4.31µs  min=2.4µs   med=3.38µs  max=573.84µs p(90)=5.39µs  p(95)=6.34µs   p(99)=11.97µs 
     http_req_connecting............: avg=77ns    min=0s      med=0s      max=117.88µs p(90)=0s      p(95)=0s       p(99)=0s      
   ✓ http_req_duration..............: avg=13.06ms min=5.29ms  med=13.49ms max=31.01ms  p(90)=15.29ms p(95)=16.98ms  p(99)=22.94ms 
       { expected_response:true }...: avg=13.06ms min=5.29ms  med=13.49ms max=31.01ms  p(90)=15.29ms p(95)=16.98ms  p(99)=22.94ms 
   ✓ http_req_failed................: 0.00%   ✓ 0         ✗ 1514
     http_req_receiving.............: avg=9.94ms  min=1.89ms  med=10.29ms max=26.85ms  p(90)=11.9ms  p(95)=13.25ms  p(99)=18.24ms 
     http_req_sending...............: avg=41.4µs  min=10.08µs med=13.09µs max=699.02µs p(90)=44.17µs p(95)=243.12µs p(99)=564.43µs
     http_req_tls_handshaking.......: avg=0s      min=0s      med=0s      max=0s       p(90)=0s      p(95)=0s       p(99)=0s      
     http_req_waiting...............: avg=3.08ms  min=1.38ms  med=3.15ms  max=16.1ms   p(90)=3.51ms  p(95)=4.14ms   p(99)=6.47ms  
     http_reqs......................: 1514    21.625065/s
     iteration_duration.............: avg=46.22ms min=34.95ms med=45.36ms max=93.99ms  p(90)=49.49ms p(95)=59.82ms  p(99)=77.46ms 
     iterations.....................: 1514    21.625065/s
     vus............................: 1       min=1       max=1 
     vus_max........................: 1       min=1       max=1